#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Checkov 🧪`failure`

<details><summary>Show Plan</summary>

module.db[0].random_pet.db: Refreshing state... [id=duckling]
module.storage[0].random_string.sac: Refreshing state... [id=rpyf]
module.db[0].random_password.password: Refreshing state... [id=none]
azurerm_resource_group.this[0]: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus]
module.app_insights[0].azurerm_monitor_action_group.this: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Insights/actionGroups/neubank-dev-action-group-eastus]
module.network[0].azurerm_network_security_group.vnet: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/networkSecurityGroups/neubank-dev-vnetnsg-eastus]
module.app_stack[0].azurerm_service_plan.this: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Web/serverFarms/neubank-dev-appserviceplan-eastus]
module.network[0].azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net]
module.app_insights[0].azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.OperationalInsights/workspaces/workspace]
module.db[0].azurerm_route_table.db: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/routeTables/neubank-dev-duckling-rt-eastus]
module.db[0].azurerm_network_security_group.db: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/networkSecurityGroups/neubank-dev-duckling-nsg-eastus]
module.network[0].azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/virtualNetworks/neubank-dev-vnet-eastus]
module.storage[0].azurerm_storage_account.blob: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Storage/storageAccounts/rpyfdevstoracceastus]
module.network[0].module.subnets.azurerm_subnet.integration: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/virtualNetworks/neubank-dev-vnet-eastus/subnets/neubank-dev-integration-subnet-eastus]
module.network[0].module.subnets.azurerm_subnet.endpoint: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/virtualNetworks/neubank-dev-vnet-eastus/subnets/neubank-dev-endpoint-subnet-eastus]
module.db[0].azurerm_subnet.db: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/virtualNetworks/neubank-dev-vnet-eastus/subnets/neubank-dev-duckling-db-subnet-eastus]
module.db[0].azurerm_subnet_network_security_group_association.db: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/virtualNetworks/neubank-dev-vnet-eastus/subnets/neubank-dev-duckling-db-subnet-eastus]
module.app_insights[0].azurerm_application_insights.this: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Insights/components/neubank-dev-frontend-appins-eastus]
module.db[0].azurerm_subnet_route_table_association.db: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/virtualNetworks/neubank-dev-vnet-eastus/subnets/neubank-dev-duckling-db-subnet-eastus]
module.db[0].azurerm_mssql_managed_instance.db: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Sql/managedInstances/neubank-dev-managedmssql-eastus]
module.storage[0].azurerm_storage_container.blob: Refreshing state... [id=https://rpyfdevstoracceastus.blob.core.windows.net/neubank-dev-sc-eastus]
module.storage[0].azurerm_private_endpoint.blob: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/privateEndpoints/neubank-dev-stendpt-eastus]
module.storage[0].azurerm_storage_blob.blob: Refreshing state... [id=https://rpyfdevstoracceastus.blob.core.windows.net/neubank-dev-sc-eastus/rr123.gif]
module.app_insights[0].azurerm_monitor_smart_detector_alert_rule.this: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.AlertsManagement/smartDetectorAlertRules/neubank-dev-frontend-smt-det-rule-eastus]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app_stack[0].azurerm_linux_web_app.backend will be created
  + resource "azurerm_linux_web_app" "backend" {
      + app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"        = (sensitive value)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING" = (sensitive value)
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = (known after apply)
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "neubank-dev-rg-eastus"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "Dev"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)
        }
    }

  # module.app_stack[0].azurerm_linux_web_app.frontend will be created
  + resource "azurerm_linux_web_app" "frontend" {
      + app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"        = (sensitive value)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING" = (sensitive value)
          + "WEBSITE_DNS_SERVER"                    = "168.63.129.16"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = (known after apply)
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "neubank-dev-rg-eastus"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "Dev"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)
        }
    }

  # module.app_stack[0].azurerm_service_plan.this must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Web/serverFarms/neubank-dev-appserviceplan-eastus" -> (known after apply)
      ~ kind                         = "app" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
        name                         = "neubank-dev-appserviceplan-eastus"
      ~ os_type                      = "Windows" -> "Linux" # forces replacement
      ~ reserved                     = false -> (known after apply)
        tags                         = {
            "Environment" = "Dev"
            "Owner"       = "first.last@company.com"
            "Project"     = "Mortgage Calculator"
        }
      ~ worker_count                 = 1 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (4 unchanged attributes hidden)
    }

  # module.app_stack[0].random_string.wapp will be created
  + resource "random_string" "wapp" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.network[0].module.endpoints.azurerm_app_service_virtual_network_swift_connection.frontend will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "frontend" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/virtualNetworks/neubank-dev-vnet-eastus/subnets/neubank-dev-integration-subnet-eastus"
    }

  # module.network[0].module.endpoints.azurerm_private_endpoint.backend will be created
  + resource "azurerm_private_endpoint" "backend" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "backwebappprivateendpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "neubank-dev-rg-eastus"
      + subnet_id                = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/virtualNetworks/neubank-dev-vnet-eastus/subnets/neubank-dev-endpoint-subnet-eastus"
      + tags                     = {
          + "Environment" = "Dev"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "privatednszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "privateendpointconnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.network[0].module.subnets.azurerm_subnet.integration will be updated in-place
  ~ resource "azurerm_subnet" "integration" {
        id                                             = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/neubank-dev-rg-eastus/providers/Microsoft.Network/virtualNetworks/neubank-dev-vnet-eastus/subnets/neubank-dev-integration-subnet-eastus"
        name                                           = "neubank-dev-integration-subnet-eastus"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 6 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

</details>

<details><summary>Show Checkov Results</summary>

### terraform scan results:

|    | check_id      | file                             | resource                                                 | check_name                                                             | guideline                                                                                                                                                       |
|----|---------------|----------------------------------|----------------------------------------------------------|------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------|
|  0 | CKV_AZURE_59  | /modules/storage/main.tf         | module.storage.azurerm_storage_account.blob              | Ensure that Storage accounts disallow public access                    | https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-networking-policies/ensure-that-storage-accounts-disallow-public-access |
|  1 | CKV2_AZURE_41 | /modules/storage/main.tf         | module.storage.azurerm_storage_account.blob              | Ensure storage account is configured with SAS expiration policy        |                                                                                                                                                                 |
|  2 | CKV2_AZURE_40 | /modules/storage/main.tf         | module.storage.azurerm_storage_account.blob              | Ensure storage account is not configured with Shared Key authorization |                                                                                                                                                                 |
|  3 | CKV2_AZURE_31 | /modules/network/subnets/main.tf | module.network.module.subnets.azurerm_subnet.endpoint    | Ensure VNET subnet is configured with a Network Security Group (NSG)   |                                                                                                                                                                 |
|  4 | CKV2_AZURE_31 | /modules/network/subnets/main.tf | module.network.module.subnets.azurerm_subnet.integration | Ensure VNET subnet is configured with a Network Security Group (NSG)   |                                                                                                                                                                 |

---

</details>

*Pusher: @mconstant, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Dev`*